МультиПорт/src/Catalogs/MultiPort_ТипИсходящегоСообщения/MultiPort_ТипИсходящегоСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>MultiPort_ТипИсходящегоСообщения</name>
  <owners>ExchangePlan.MultiPort_ВнешниеСистемы</owners>
  <attributes>
    <name>ТехническоеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтеграционныйПроцесс</name>
    <type>
      <types>CatalogRef.MultiPort_ИнтеграционныеПроцессы</types>
    </type>
  </attributes>
</mdclass:Catalog>

МультиПорт/src/InformationRegisters/MultiPort_ИспользуемыеНастройкиДляСообщений/MultiPort_ИспользуемыеНастройкиДляСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>MultiPort_ИспользуемыеНастройкиДляСообщений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НастройкаДляСообщения</name>
    <type>
      <types>CatalogRef.MultiPort_НастройкиВходящихСообщений</types>
      <types>CatalogRef.MultiPort_НастройкиИсходящихСообщений</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>CatalogRef.MultiPort_ТипВходящегоСообщения</types>
      <types>CatalogRef.MultiPort_ТипИсходящегоСообщения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МультиПорт/src/Catalogs/MultiPort_ТипИсходящегоСообщения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
Функция ИдентификаторТипаИсходящегоУникален(Объект, Отказ) Экспорт
	
	ТекстСообщения = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипИсходящегоСообщения.Представление КАК Представление,
	|	ТипИсходящегоСообщения.Код КАК Код
	|ИЗ
	|	Справочник.MultiPort_ТипИсходящегоСообщения КАК ТипИсходящегоСообщения
	|ГДЕ
	|	ТипИсходящегоСообщения.ТехническоеИмя = &ТехническоеИмя
	|	И ТипИсходящегоСообщения.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ТехническоеИмя", Объект.ТехническоеИмя);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстСообщения = СтрШаблон("Тип исходящего сообщения с таким техническим именем (мнемокодом) уже существует %1 %2",
									Выборка.Код, Выборка.Представление);		
		Отказ = Истина;							
		Возврат ТекстСообщения;		
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция УстановленСинхронныйРежим(ТипИсходящегоСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	MultiPort_ИспользуемыеНастройкиДляСообщенийСрезПоследних.НастройкаДляСообщения КАК НастройкаДляСообщения
	|ПОМЕСТИТЬ Настройки
	|ИЗ
	|	РегистрСведений.MultiPort_ИспользуемыеНастройкиДляСообщений.СрезПоследних(, ТипСообщения = &ТипИсходящегоСообщения) КАК MultiPort_ИспользуемыеНастройкиДляСообщенийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Настройки.НастройкаДляСообщения КАК НастройкаКвитанцииСсылка,
	|	ЕСТЬNULL(MultiPort_НастройкиИсходящихСообщений.СинхронныйРежим, ЛОЖЬ) КАК СинхронныйРежим
	|ИЗ
	|	Настройки КАК Настройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.MultiPort_НастройкиИсходящихСообщений КАК MultiPort_НастройкиИсходящихСообщений
	|		ПО Настройки.НастройкаДляСообщения = MultiPort_НастройкиИсходящихСообщений.Ссылка";
	Запрос.УстановитьПараметр("ТипИсходящегоСообщения", ТипИсходящегоСообщения);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	СинхронныйРежим = Ложь;
	Если Выборка.Следующий() Тогда
		СинхронныйРежим = Выборка.СинхронныйРежим;		
	КонецЕсли;
	
	Возврат СинхронныйРежим;
	
КонецФункции

#КонецЕсли
